---
kind: method
id: M:Autodesk.Revit.UI.RibbonPanel.Equals(System.Object)
zh: 功能区
source: html/ca7ce9f5-df5d-298c-3760-34b2cbbcbd12.htm
---
# Autodesk.Revit.UI.RibbonPanel.Equals Method

**中文**: 功能区

Determines whether the specified Object is equal to the current Object .

## Syntax (C#)
```csharp
public override bool Equals(
	Object obj
)
```

## Parameters
- **obj** (`System.Object`) - Another panel object.